# Creating a series

In [1]:
# Exp 3

In [2]:
#Aim : Basics of Data Frames

In [3]:
#Name:Punam Khotele
#Year:3^rd
#Sec:C
#Roll No.:30
#sub:ET-I

In [4]:
import pandas as pd

In [5]:
#Creating Student Name list
Name = ["ABC","DEF","GHI","JKL","XYZ"]
Name #display

['ABC', 'DEF', 'GHI', 'JKL', 'XYZ']

In [6]:
#Creating a series
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1    ABC
2    DEF
3    GHI
4    JKL
5    XYZ
dtype: object

# Creating DataFrames

In [7]:
import pandas as pd

In [8]:
#Creating a dataframes
df=pd.DataFrame([[10,12,14,16],[11,18,15,13],[13,15,16,10]],
columns=["CD","DBMS","DSS","CAO"])

In [9]:
df

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   13
2  13    15   16   10

In [10]:
df.shape

(3, 4)

In [11]:
df.size

12

In [12]:
df.ndim

2

# Adding Record (Row) to the data Frame

In [13]:
df2=pd.DataFrame([[10,12,14,16]],
columns=["CD","DBMS","DSS","CAO"])

In [14]:
df3 = df.append(df2,ignore_index=True)

In [15]:
df3

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   13
2  13    15   16   10
3  10    12   14   16

In [16]:
df3.size

16

In [17]:
df3.shape

(4, 4)

In [21]:
#Dimension
df3.ndim

2

In [22]:
df3["DM"] = [12,24,16,18]

In [23]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  12
1  11    18   15   13  24
2  13    15   16   10  16
3  10    12   14   16  18

In [24]:
#Delete a record = 1
df4=df3.drop(index=[1])

In [25]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    12   14   16  12
2  13    15   16   10  16
3  10    12   14   16  18

In [26]:
# Deleting Attribute (Columns) from df3 dataframe

In [27]:
df5 = df3.drop(columns=["DM"])

In [28]:
df5

   CD  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   13
2  13    15   16   10
3  10    12   14   16

In [29]:
#finding a mean of DSS
print("Mean of DSS : " ,df5["DSS"].mean())

Mean of DSS :  14.75

In [30]:
#Finding a median of DSS
print("Median of DSS : ",df5["DSS"].median())

Median of DSS :  14.5

In [31]:
#Finding a Mode of DSS
print("Mode of DSS : ",df5["DSS"].mode())

Mode of DSS :  0    14
dtype: int64

In [32]:
#log and #ilog